import React, {useState} from 'react';
import './Information.css'

const Information = (props) => {
    const [active,setActive] = useState(false)

    return (
        <div className='informationAll'>
                <h1>Доставка суші у Львові</h1>

            <div className={active ? 'information active' : 'information'}>
                <p><b>Ми відновлюємо роботу і працюємо для клієнтів!</b></p>

                <p><b>Графік роботи: з 10:00 до 20:00</b></p>

                <p><b>А також не припиняємо допомогати у цей складний час: годуємо піцою волонтерів, військових та переселенців. 
                    Також приймаємо гуманітарну допомогу для тих, хто потребує.</b></p>

                <p>Друзяшки, я чесно не знаю, що може бути краще за суші з доставкою! Бо суші в тему завжди: і на свято, 
                    і щоб зробити свято в робочі дні, і на посиденьках з подружками, і на побаченні. І нікуди не треба 
                    йти: просто замовив і чекаєш до 59-и хв свої вкусняшки!</p>

                <p>SUSHI-GO постаралися, щоб всі макі, роли, гарячі роли і, конешно, сети були супер ситні, супер рибні 
                    (без риби теж є, якщо хто не їсть), супер смачні! Усі інгредієнти я дотошно перевіряєм на свіжість і 
                    поживність. Щоб та Філадельфія чи Каліфорнія (чи що ви там вибрали) аж танула в роті й доставляла тільки 
                    кайфушечки.</p>

                <p>Я думаю, що японці б просто відлетіли в космос, якби могли спробувати доставку cуші SUSHI-GO! А вам ось 
                    пощастило більше — ви можете замовити суші з доставкою у Львові просто зараз, напруживши тільки пальці 
                    руки, щоб оформити замовлення 🙂 Бо SUSHI-GO — це найшвидша доставка суші!</p>
            </div>
            <button className='btnHide' onClick={() => setActive(!active)}>{active ? 'Приховати' : 'Читати більше'}</button>
        </div>
    )
}


export default Information;